app/controllers/admin/main_controller.rb

  def index
    @total_orders = Order.active.count
---
SELECT count(*) AS count_all FROM `orders`