app/controllers/admin/orders_controller.rb

SELECT * FROM `orders`
---
  def index
    @orders = Order.all

SELECT * FROM `orders` WHERE (`orders`.`id` = 4)
---
  def show
    @order = Order.find(params[:id])

SELECT * FROM `orders` WHERE (`orders`.`id` = 4)
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('Adam O', '444', '2010-11-05 05:42:47', '2010-11-05 05:42:47', 'check', 'test@test.co')
---
  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save

SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
UPDATE `orders` SET `updated_at` = '2010-11-08 22:07:56', `shipped_on` = '2010-11-08 22:07:00', `is_active` = 1 WHERE `id` = 3
---
  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])

SELECT * FROM `orders` WHERE (`orders`.`id` = 4)
DELETE FROM `orders` WHERE `id` = 4
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy