app/controllers/admin/product_images_controller.rb

SELECT * FROM `product_images` WHERE (`product_images`.product_id = 48)
---
  def show
    @product_image = ProductImage.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 48)
---
  def new
    @product_image = ProductImage.new
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 48)
INSERT INTO `product_images` (`photo_file_size`, `product_id`, `photo_file_name`, `photo_content_type`, `photo_updated_at`) VALUES(7940, 48, 'adam_pic.jpg', 'image/jpeg', '2010-11-09 04:39:19')
---
  def create
    if request.post?

      @product_image = ProductImage.new(params[:product_image])
      @product = Product.find(params[:id])
      @product.product_images << @product_image