app/controllers/admin/products_controller.rb

  def index
    @products = Product.all.paginate(:page => params[:page])
---
SELECT * FROM `products`

  def create
    if request.post?
      @product = Product.new(params[:product])
      if @product.save
---
INSERT INTO `products` (`price`, `created_at`, `title`, `updated_at`, `description`) VALUES(5.0, '2010-11-05 01:02:40', 'Test343', '2010-11-05 01:02:40', 'test')

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(params[:product])
---
SELECT * FROM `products` WHERE (`products`.`id` = 41)
UPDATE `products` SET `updated_at` = '2010-11-08 22:39:03', `title` = 'Skinny Jeans - torn' WHERE `id` = 48

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM `products` WHERE (`products`.`id` = 41)
DELETE FROM `products` WHERE `id` = 41