app/controllers/admin/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `email`) VALUES('John Doe', '21772436000.305978505280546', '2010-11-08 22:26:54', '2010-11-08 22:26:54', '2452d8e1ea85ee3691d81fd6407b1ebf0350f229', 'sgribley@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-11-05 05:15:27', `salt` = '21750565400.482382382923071', `hashed_password` = 'ec16bbc5360ce3c6c622e82f4cc3e6f76ee74c18' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])