app/controllers/public/main_controller.rb

  def find_cart
    @cart = if session[:cart_id]
      Cart.find(session[:cart_id]) || Cart.create
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES('2010-11-10 03:53:51', '2010-11-10 03:53:51')
SELECT * FROM `carts` WHERE (`carts`.`id` = 70)