app/controllers/public/store_controller.rb

  def add_to_cart
    begin
      product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 5)

  def empty_cart
    @cart = Cart.find(session[:cart_id]).destroy
---
DELETE FROM `carts` WHERE `id` = 48
SELECT * FROM `carts` WHERE (`carts`.`id` = 48)

  def checkout
    if @cart.cart_items.empty?
---
SELECT * FROM `cart_items` WHERE (`cart_items`.cart_id = 68)
SELECT count(*) AS count_all FROM `cart_items` WHERE (`cart_items`.cart_id = 60)

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    @order.is_active = true
    if @order.save
      @cart.destroy
---
INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2010-11-03 17:32:02', 5, 4, 3, 200.0, '2010-11-03 17:32:02')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `shipped_on`, `is_active`, `email`) VALUES('Adam O\'Connor', 'testing 123', '2010-11-08 23:34:43', '2010-11-08 23:34:43', 'cc', NULL, 1, 'northband@gmail.com')
DELETE FROM `carts` WHERE `id` = 61