app/controllers/application_controller.rb

  def find_cart
    @cart = if session[:cart_id]
      Cart.find(session[:cart_id]) || Cart.create
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES('2010-11-03 01:16:14', '2010-11-03 01:16:14')
SELECT * FROM `carts` WHERE (`carts`.`id` = 7)