app/controllers/store_controller.rb

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2010-10-31 23:22:34', 5, 1, 1, 50.0, '2010-10-31 23:22:34')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('Adam O', '668 Jefferson', '2010-10-31 23:22:34', '2010-10-31 23:22:34', 'check', 'northband@gmail.com')