app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('Adam', '21748239800.853245522054685', '2010-10-31 23:49:09', '2010-10-31 23:49:09', '62e7a94e41565a245242e69f8013eaa619c22ab9')